# BuiltInFailures.CurveFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurveFailures Class
BuiltInFailures Class Members See Also
---
Failures about Curves and Curve-Driven Elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class CurveFailures
```

Visual Basic
---
```text
Public NotInheritable Class CurveFailures
```

Visual C++
---
```text
public ref class CurveFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..CurveFailures
# See Also
BuiltInFailures..::..CurveFailures Members
Autodesk.Revit.DB Namespace